InformationRegisters/бит_ИнформацияТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ИнформацияТСЖ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Председатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОрганыФМС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТСЖ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/бит_ИнформацияОТСЖ/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Период", Период);
	Параметры.Свойство("ТСЖ"   , ТСЖ);
	
	ЗаполнитьОписание();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьОписание();
КонецПроцедуры

&НаКлиенте
Процедура ТСЖПриИзменении(Элемент)
	ЗаполнитьОписание();
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция получает список ТСЖ.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСписокТСЖ(Период)
	
	СписокТСЖ = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ
	|ИЗ
	|	РегистрСведений.бит_ИнформацияТСЖ.СрезПоследних(&Период, ) КАК бит_ИнформацияТСЖСрезПоследних
	|ГДЕ
	|	(бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия > &Период)
	|	И бит_ИнформацияТСЖСрезПоследних.Здание.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Таблица = Результат.Выгрузить();
		СписокТСЖ.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку("ТСЖ"));
		
	КонецЕсли; 
	
	Возврат СписокТСЖ;
	
КонецФункции // ()

&НаКлиенте
Процедура ТСЖНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьСписокТСЖ(Период);
	
КонецПроцедуры

&НаСервере
// Процедура заполняет описание. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьОписание()
	
	Председатель        = Неопределено;
	КонтролирующийОрган = Неопределено;
	
	АдресТСЖ   = "";
	ТелефонТСЖ = "";
	
	АдресКО   = "";
	ТелефонКО = "";
	СайтКО    = "";
	
	СписокЗданий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	Запрос.УстановитьПараметр("ТСЖ"   , ТСЖ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ИнформацияТСЖСрезПоследних.Здание,
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ КАК ТСЖ,
	|	бит_ИнформацияТСЖСрезПоследних.ДатаСоздания,
	|	бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия,
	|	бит_ИнформацияТСЖСрезПоследних.Председатель КАК Председатель,
	|	бит_ИнформацияТСЖСрезПоследних.КонтролирующийОрган КАК КонтролирующийОрган,
	|	бит_ИнформацияТСЖСрезПоследних.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес
	|ИЗ
	|	РегистрСведений.бит_ИнформацияТСЖ.СрезПоследних(&Период, ТСЖ = &ТСЖ) КАК бит_ИнформацияТСЖСрезПоследних
	|ИТОГИ
	|	МАКСИМУМ(Председатель),
	|	МАКСИМУМ(КонтролирующийОрган)
	|ПО
	|	ТСЖ";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		КонтролирующийОрган = Выборка.КонтролирующийОрган;
		Председатель        = Выборка.Председатель;
		
		Если ТипЗнч(ТСЖ) = Тип("СправочникСсылка.Контрагенты") Тогда
			АдресТСЖ   = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ТСЖ, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
			ТелефонТСЖ = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ТСЖ, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		Иначе
			АдресТСЖ   = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ТСЖ, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
			ТелефонТСЖ = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ТСЖ, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтролирующийОрган) Тогда
			АдресКО   = бит_ПаспортныйСтолСервер.ПолучитьАдресИзКонтактнойИнформации(КонтролирующийОрган, "Фактический");
			ТелефонКО = бит_ПаспортныйСтолСервер.ПолучитьТелефонИзКонтактнойИнформации(КонтролирующийОрган);
			СайтКО    = бит_ПаспортныйСтолСервер.ПолучитьВебСтраницуИзКонтактнойИнформации(КонтролирующийОрган);
		КонецЕсли; 
		
		ВыборкаЗдания = Выборка.Выбрать();
		
		Пока ВыборкаЗдания.Следующий() Цикл
			
			НоваяСтрока = СписокЗданий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗдания);
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры // () 

#КонецОбласти
